jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
      <!-- ******************************  XMC4104-Q48x64  ****************************** -->
      <device Dname="XMC4104-Q48x64">
        <processor Dclock="80000000"/>
        <compile header="Device\XMC4100_series\Include\XMC4100.h"  define="XMC4104_Q48x64"/>
        <debug      svd="SVD\XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4200_4100_64.FLM" start="0x0C000000" size="0x10000"                  default="1"/>
        <algorithm  name="Flash\XMC4200_4100c_64.FLM" start="0x08000000" size="0x10000"                 default="1"/>
        <book    name="Documents\xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4100_XMC4200-DS-v01_02-en.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents\XMC4100_XMC4200_AB_Errata_Sheet_v1_1.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>  
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="IOs"           n="21"/>
        <feature type="QFN"           n="48"/>          
      </device>

      <!-- ******************************  XMC4104-F64x128  ****************************** -->
      <device Dname="XMC4104-F64x128">
        <processor Dclock="80000000"/>
        <compile header="Device\XMC4100_series\Include\XMC4100.h"  define="XMC4104_F64x128"/>
        <debug      svd="SVD\XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4200_4100_128.FLM" start="0x0C000000" size="0x20000"                 default="1"/>
        <algorithm  name="Flash\XMC4200_4100c_128.FLM" start="0x08000000" size="0x20000"                default="1"/>
        <book    name="Documents\xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4100_XMC4200-DS-v01_02-en.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents\XMC4100_XMC4200_AB_Errata_Sheet_v1_1.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>    
        <feature type="ADC"           n="10"       m="12"/>
        <feature type="IOs"           n="35"/>
        <feature type="QFP"           n="64"/>          
      </device>

      <!-- ******************************  XMC4104-Q48x128  ****************************** -->
      <device Dname="XMC4104-Q48x128">
        <processor Dclock="80000000"/>
        <compile header="Device\XMC4100_series\Include\XMC4100.h"  define="XMC4104_Q48x128"/>
        <debug      svd="SVD\XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x20000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4200_4100_128.FLM" start="0x0C000000" size="0x20000"                 default="1"/>
        <algorithm  name="Flash\XMC4200_4100c_128.FLM" start="0x08000000" size="0x20000"                default="1"/>
        <book    name="Documents\xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4100_XMC4200-DS-v01_02-en.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents\XMC4100_XMC4200_AB_Errata_Sheet_v1_1.pdf"          title="XMC4100 Series Errata Sheet"/>       
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>  
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="IOs"           n="21"/>
        <feature type="QFN"           n="48"/>          
      </device>

      <!-- ******************************  XMC4108-F64x64  ****************************** -->
      <device Dname="XMC4108-F64x64">
        <processor Dclock="80000000"/>
        <compile header="Device\XMC4100_series\Include\XMC4100.h"  define="XMC4108_F64x64"/>
        <debug      svd="SVD\XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4200_4100_64.FLM" start="0x0C000000" size="0x10000"                  default="1"/>
        <algorithm  name="Flash\XMC4200_4100c_64.FLM" start="0x08000000" size="0x10000"                 default="1"/>
        <book    name="Documents\xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4100_XMC4200-DS-v01_02-en.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents\XMC4100_XMC4200_AB_Errata_Sheet_v1_1.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>  
        <feature type="ADC"           n="10"       m="12"/>
        <feature type="CAN"           n="1"/>
        <feature type="IOs"           n="21"/>
        <feature type="QFP"           n="64"/>          
      </device>              

      <!-- ******************************  XMC4108-Q48x64  ****************************** -->
      <device Dname="XMC4108-Q48x64">
        <processor Dclock="80000000"/>
        <compile header="Device\XMC4100_series\Include\XMC4100.h"  define="XMC4108_Q48x64"/>
        <debug      svd="SVD\XMC4100.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x10000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4200_4100_64.FLM" start="0x0C000000" size="0x10000"                  default="1"/>
        <algorithm  name="Flash\XMC4200_4100c_64.FLM" start="0x08000000" size="0x10000"                 default="1"/>
        <book    name="Documents\xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4100 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4100_XMC4200-DS-v01_02-en.pdf"       title="XMC4100 Series Data Sheet"/>
        <book    name="Documents\XMC4100_XMC4200_AB_Errata_Sheet_v1_1.pdf"          title="XMC4100 Series Errata Sheet"/>
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/> 
        <feature type="ADC"           n="9"       m="12"/>
        <feature type="CAN"           n="1"/>
        <feature type="IOs"           n="21"/>
        <feature type="QFN"           n="48"/>          
      </device>
      
      </subFamily>

      <!-- ******************************  XMC4200  ****************************** -->
      <subFamily DsubFamily="XMC4200 Series">
        <feature type="CAN"           n="2"/>
        <feature type="DMA"           n="8"/>
        <feature type="USBD"          n="1"/>     
        <feature type="ComOther"      n="4"                         name="Universal Serial Interface"/>
             
      <!-- ******************************  XMC4200-F64x256   ****************************** -->
      <device Dname="XMC4200-F64x256 ">
        <processor Dclock="80000000"/>
        <compile header="Device\XMC4200_series\Include\XMC4200.h"  define="XMC4200_F64x256"/>
        <debug      svd="SVD\XMC4200.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x5FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4200_4100_256.FLM" start="0x0C000000" size="0x40000"                 default="1"/>
        <algorithm  name="Flash\XMC4200_4100c_256.FLM" start="0x08000000" size="0x40000"                default="1"/>
        <book    name="Documents\xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4200 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4100_XMC4200-DS-v01_02-en.pdf"       title="XMC4200 Series Data Sheet"/>
        <book    name="Documents\XMC4100_XMC4200_AB_Errata_Sheet_v1_1.pdf"          title="XMC4200 Series Errata Sheet"/>
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>    
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="35"/>
        <feature type="QFP"           n="64"/>          
      </device>

      <!-- ******************************  XMC4200-Q48x256   ****************************** -->
      <device Dname="XMC4200-Q48x256 ">
        <processor Dclock="80000000"/>
        <compile header="Device\XMC4200_series\Include\XMC4200.h"  define="XMC4200_Q48x256"/>
        <debug      svd="SVD\XMC4200.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x40000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x5FC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4200_4100_256.FLM" start="0x0C000000" size="0x40000"                 default="1"/>
        <algorithm  name="Flash\XMC4200_4100c_256.FLM" start="0x08000000" size="0x40000"                default="1"/>
        <book    name="Documents\xmc4100_xmc4200_rm_v1.5_2014_04.pdf"       title="XMC4200 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4100_XMC4200-DS-v01_02-en.pdf"       title="XMC4200 Series Data Sheet"/>
        <book    name="Documents\XMC4100_XMC4200_AB_Errata_Sheet_v1_1.pdf"          title="XMC4200 Series Errata Sheet"/>
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>  
        <feature type="ADC"           n="9"      m="12"/>
        <feature type="IOs"           n="21"/>
        <feature type="QFN"           n="48"/>          
      </device>      
      </subFamily>

      <!-- ************************  Subfamily 'XMC4400'  **************************** -->
      <subFamily DsubFamily="XMC4400 Series">
        <feature type="CAN"           n="2"/>
        <feature type="DMA"           n="8"/>
        <feature type="USBD"          n="1"/>
        <feature type="ComOther"      n="4"                         name="Universal Serial Interface"/>
      
      <!-- ******************************  XMC4400-F100x512   ****************************** -->
      <device Dname="XMC4400-F100x512 ">
        <processor Dclock="120000000"/>
        <compile header="Device\XMC4400_series\Include\XMC4400.h"  define="XMC4400_F100x512"/>
        <debug      svd="SVD\XMC4400.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x80000"    startup="0"   default="0"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xFFC0"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\XMC4400_512.FLM"    start="0x0C000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\XMC4400c_512.FLM"   start="0x08000000"  size="0x80000"                  default="1"/>
        <book    name="Documents\xmc4400_rm_v1.5_2014_04.pdf"               title="XMC4400 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4400-DS-v01_01-en.pdf"               title="XMC4400 Series Data Sheet"/>
        <book    name="Documents\XMC4400_AB_Errata_Sheet_v1_2.pdf"          title="XMC4400 Series Errata Sheet"/>
        <book    name="Device\XMClib\doc\XMC4_Peripheral_Library.chm"       title="XMC4 Peripheral Library"/>        
        <feature type="ETH" n="1" m="100000000"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="55"/>
        <feature type="QFP"           n="100"/>             
      </device>

