jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
      <!-- ******************************  XMC4700-F144x2048  ****************************** -->
      <device Dname="XMC4700-F144x2048">
        <processor Dclock="144000000"/>
        <compile header="Device\XMC4700_series\Include\XMC4700.h"  define="XMC4700_F144x2048"/>
        <debug      svd="SVD\XMC4700.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x200000"   startup="0"   default="0"/>  
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>            
        <algorithm  name="Flash\XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents\xmc4800_rm_v1.0_2015_06.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4700_XMC4800_DATA_SHEET-ATI-v00_06-EN.pdf"     title="XMC4800 Series Data Sheet"/>       
        <feature type="ADC"           n="32"      m="12"/>
      </device> 

      <!-- ******************************  XMC4700-F100x2048  ****************************** -->
      <device Dname="XMC4700-F100x2048">
        <processor Dclock="144000000"/>
        <compile header="Device\XMC4700_series\Include\XMC4700.h"  define="XMC4700_F100x2048"/>
        <debug      svd="SVD\XMC4700.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x200000"   startup="0"   default="0"/>  
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC0"    init   ="0"   default="1"/>           
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>         
        <algorithm  name="Flash\XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents\xmc4800_rm_v1.0_2015_06.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4700_XMC4800_DATA_SHEET-ATI-v00_06-EN.pdf"     title="XMC4800 Series Data Sheet"/>       
        <feature type="ADC"           n="24"      m="12"/>
      </device> 

      <!-- ******************************  XMC4700-E196x1536  ****************************** -->
      <device Dname="XMC4700-E196x1536">
        <processor Dclock="144000000"/>
        <compile header="Device\XMC4700_series\Include\XMC4700.h"  define="XMC4700_E196x1536"/>
        <debug      svd="SVD\XMC4700.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x180000"   startup="0"   default="0"/>   
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2CFC0"    init   ="0"   default="1"/>           
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>         
        <algorithm  name="Flash\XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents\xmc4800_rm_v1.0_2015_06.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4700_XMC4800_DATA_SHEET-ATI-v00_06-EN.pdf"     title="XMC4800 Series Data Sheet"/>       
        <feature type="ADC"           n="32"      m="12"/>
      </device>

      <!-- ******************************  XMC4700-F144x1536  ****************************** -->
      <device Dname="XMC4700-F144x1536">
        <processor Dclock="144000000"/>
        <compile header="Device\XMC4700_series\Include\XMC4700.h"  define="XMC4700_F144x1536"/>
        <debug      svd="SVD\XMC4700.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x180000"   startup="0"   default="0"/>   
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2CFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>         
        <algorithm  name="Flash\XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents\xmc4800_rm_v1.0_2015_06.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4700_XMC4800_DATA_SHEET-ATI-v00_06-EN.pdf"     title="XMC4800 Series Data Sheet"/>       
        <feature type="ADC"           n="32"      m="12"/>
      </device>

      <!-- ******************************  XMC4700-F100x1536  ****************************** -->
      <device Dname="XMC4700-F100x1536">
        <processor Dclock="144000000"/>
        <compile header="Device\XMC4700_series\Include\XMC4700.h"  define="XMC4700_F100x1536"/>
        <debug      svd="SVD\XMC4700.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x180000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x180000"   startup="0"   default="0"/>    
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2CFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFE8000"  size="0x18000"    init   ="0"   default="1"/>    
        <algorithm  name="Flash\XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents\xmc4800_rm_v1.0_2015_06.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4700_XMC4800_DATA_SHEET-ATI-v00_06-EN.pdf"     title="XMC4800 Series Data Sheet"/>       
        <feature type="ADC"           n="24"      m="12"/>
      </device>
      </subFamily>
      
