jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
      <!-- ******************************  XMC4800-F100x1024  ****************************** -->
      <device Dname="XMC4800-F100x1024">
        <processor Dclock="144000000"/>
        <compile header="Device\XMC4800_series\Include\XMC4800.h"  define="XMC4800_F100x1024"/>
        <debug      svd="SVD\XMC4800.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x0C000000"  size="0x100000"   startup="0"   default="0"/>  
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1FFC0"    init   ="0"   default="1"/>       
        <memory     id="IRAM2"                      start="0x1FFEE000"  size="0x12000"    init   ="0"   default="1"/>          
        <algorithm  name="Flash\XMC4800_2048.FLM"   start="0x0C000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\XMC4800c_2048.FLM"  start="0x08000000"  size="0x100000"                 default="1"/>      
        <book    name="Documents\xmc4800_rm_v1.0_2015_06.pdf"                   title="XMC4800 Series Reference Manual"/>
        <book    name="Documents\Infineon-XMC4700_XMC4800_DATA_SHEET-ATI-v00_06-EN.pdf"     title="XMC4800 Series Data Sheet"/>       
        <feature type="ADC"           n="24"      m="12"/>
      </device>
      </subFamily>
      
    </family>
  </devices>

  <boards>
    <board vendor="Infineon" name="XMC4200 CPU Board - Actuator  (CPU_42A)" revision="V2" salesContact="sales@infineon.com" orderForm="http://ehitex.com/starter-kits/for-xmc4000/410/xmc4500-enterprise-kit">
      <description>XMC4200 Application Kit Board Support and Examples</description>
      <image small="Images\Hexagon-XMC4200-small.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontroller/32-bit-industrial-microcontroller-based-on-arm-registered-cortex-tm-m/32-bit-xmc4000-industrial-microcontroller-arm-registered-cortex-tm-m4/channel.html?channel=db3a30433580b3710135a03abaf9385e" title="XMC4200 CPU Board - Actuator  (CPU_42A)"/>
      <book category="schematic" name="Documents\PCB_Sources_Eagle_CPU_42A-V1-4.zip" title="Schematics"/>
      <book category="manual"    name="Documents\Board_Users_Manual_CPU_Board_XMC4400_General_Purpose_R1 0.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC4200-F64x256"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC4200 Series"/>
        <feature type="XTAL"      n="12000000"/>
        <feature type="XTAL"      n="32768"/>
        <feature type="ROM"       n="1"              name="32 MBit Quad-SPI Flash"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="USB"       n="1"              name="USB OTG (Micro-AB)"/>
        <feature type="ConnOther" n="1"              name="DriveMonitor2 Connector (10-pin + 6-pin)"/>
        <feature type="ConnOther" n="1"              name="HMI Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="COM Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="ACT Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="Power Scale Connector (for power measurement)"/>
        <feature type="Button"    n="1"              name="Reset"/>
        <feature type="ContOther" n="1"              name="2-Pin DIP Switch (Hardware boot mode selection)"/>
        <feature type="Poti"      n="1"              name="Potentiometer for ADC (connected to P14.1)"/>
        <feature type="LED"       n="5"              name="LEDs: 1 x User (P3.9), 3.3 Volt, 5 Volt, 5 Volt USB, PORST"/>
        <feature type="CustomFF"  n="95" m="95"      name="Hexagon Application Kit Form Factor"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
      </board>
      
    <board vendor="Infineon" name="XMC4400 CPU Board - General Purpose  (CPU_44A)" revision="V2" salesContact="sales@infineon.com" orderForm="http://ehitex.com/starter-kits/for-xmc4000/410/xmc4500-enterprise-kit">
      <description>XMC4400 Application Kit Board Support and Examples</description>
      <image small="Images\Hexagon-XMC4400-small.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontroller/32-bit-industrial-microcontroller-based-on-arm-registered-cortex-tm-m/32-bit-xmc4000-industrial-microcontroller-arm-registered-cortex-tm-m4/channel.html?channel=db3a30433580b3710135a03abaf9385e" title="XMC4400 CPU Board - General Purpose (CPU_44A) Web Page"/>
      <book category="schematic" name="Documents\Public_PCB_Sources_CPU_44A-V2-1.zip" title="Schematics"/>
      <book category="manual"    name="Documents\Board_Users_Manual_CPU_Board_XMC4400_General_Purpose_R1 0.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC4400-F100x512"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC4400 Series"/>
        <feature type="XTAL"      n="12000000"/>
        <feature type="XTAL"      n="32768"/>
        <feature type="ROM"       n="1"              name="32 MBit Quad-SPI Flash"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="USB"       n="1"              name="USB OTG (Micro-AB)"/>
        <feature type="ConnOther" n="1"              name="DriveMonitor2 Connector (10-pin + 6-pin)"/>
        <feature type="ConnOther" n="1"              name="HMI Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="COM Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="ACT Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="Power Scale Connector (for power measurement)"/>
        <feature type="Button"    n="1"              name="Reset"/>
        <feature type="ContOther" n="1"              name="2-Pin DIP Switch (Hardware boot mode selection)"/>
        <feature type="Poti"      n="1"              name="Potentiometer for ADC (connected to P14.1)"/>
        <feature type="LED"       n="5"              name="LEDs: 1 x User (P3.9), 3.3 Volt, 5 Volt, 5 Volt USB, PORST"/>
        <feature type="CustomFF"  n="95" m="95"      name="Hexagon Application Kit Form Factor"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
      </board>
      
    <board vendor="Infineon" name="XMC4500 CPU Board - General Purpose (CPU_45A)" revision="V3" salesContact="sales@infineon.com" orderForm="http://ehitex.com/starter-kits/for-xmc4000/410/xmc4500-enterprise-kit">
      <description>XMC4500 CPU Board - General Purpose (CPU_45A) Board Support and Examples</description>
      <image small="Images\Hexagon-XMC4500-small.jpg" large="Images\Hexagon-XMC4500-large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontroller/32-bit-industrial-microcontroller-based-on-arm-registered-cortex-tm-m/32-bit-xmc4000-industrial-microcontroller-arm-registered-cortex-tm-m4/channel.html?channel=db3a30433580b3710135a03abaf9385e" title="XMC4500 CPU Board - General Purpose (CPU_45A) Web Page"/>
      <book category="schematic" name="Documents\PCB_Sources_Eagle_CPU_45A-V2.zip" title="Schematics"/>
      <book category="manual"    name="Documents\Board_Users_Manual_CPU_Board_XMC4500_General_Purpose_(CPU_45A-V3)_R1.0.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC4500-F144x1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC4500 Series"/>
        <feature type="XTAL"      n="12000000"/>
        <feature type="XTAL"      n="32768"/>
        <feature type="ROM"       n="1"              name="32 MBit Quad-SPI Flash"/>
          <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="USB"       n="1"              name="USB OTG (Micro-AB)"/>
        <feature type="ConnOther" n="1"              name="DriveMonitor2 Connector (10-pin + 6-pin)"/>
        <feature type="ConnOther" n="1"              name="HMI Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="COM Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="ACT Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="Power Scale Connector (for power measurement)"/>
        <feature type="Button"    n="1"              name="Reset"/>
        <feature type="ContOther" n="1"              name="2-Pin DIP Switch (Hardware boot mode selection)"/>
        <feature type="Poti"      n="1"              name="Potentiometer for ADC (connected to P14.1)"/>
        <feature type="LED"       n="5"              name="LEDs: 1 x User (P3.9), 3.3 Volt, 5 Volt, 5 Volt USB, PORST"/>
        <feature type="CustomFF"  n="95" m="95"      name="Hexagon Application Kit Form Factor"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

