jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
    <board vendor="Infineon" name="XMC4500 CPU Board - General Purpose (CPU_45B)" revision="V2" salesContact="sales@infineon.com" orderForm="http://ehitex.com/starter-kits/for-xmc4000/410/xmc4500-enterprise-kit">
      <description>XMC4500 CPU Board - General Purpose (CPU_45B) Board Support and Examples</description>
      <image small="Images\XMC4500_SDRAM_small.jpg" large="Images\XMC4500_SDRAM.png"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontroller/32-bit-industrial-microcontroller-based-on-arm-registered-cortex-tm-m/32-bit-xmc4000-industrial-microcontroller-arm-registered-cortex-tm-m4/channel.html?channel=db3a30433580b3710135a03abaf9385e" title="XMC4500 CPU Board - General Purpose (CPU_45A) Web Page"/>
      <book category="schematic" name="Documents\PCB_Sources_Eagle_CPU_45B-V1.zip" title="Schematics"/>
      <book category="manual"    name="Documents\Board_Users_Manual_CPU_Board_XMC4500_SDRAM_R1_0.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC4500-E144x1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC4500 Series"/>
        <feature type="XTAL"      n="12000000"/>
        <feature type="XTAL"      n="32768"/>
        <feature type="ROM"       n="1"              name="32 MBit Quad-SPI Flash"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="USB"       n="1"              name="USB OTG (Micro-AB)"/>
        <feature type="ConnOther" n="1"              name="DriveMonitor2 Connector (10-pin + 6-pin)"/>
        <feature type="ConnOther" n="1"              name="HMI Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="COM Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="ACT Satellite Connector (80-pin edge card)"/>
        <feature type="ConnOther" n="1"              name="Power Scale Connector (for power measurement)"/>
        <feature type="Button"    n="1"              name="Reset"/>
        <feature type="ContOther" n="1"              name="2-Pin DIP Switch (Hardware boot mode selection)"/>
        <feature type="Poti"      n="1"              name="Potentiometer for ADC (connected to P14.1)"/>
        <feature type="LED"       n="5"              name="LEDs: 1 x User (P3.9), 3.3 Volt, 5 Volt, 5 Volt USB, PORST"/>
        <feature type="CustomFF"  n="95" m="95"      name="Hexagon Application Kit Form Factor"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
    
    <board vendor="Infineon" name="XMC4500 Relax Lite Kit" revision="V1" salesContact="sales@infineon.com" orderForm="http://ehitex.com/starter-kits/for-xmc4000/410/xmc4500-relax-kit">
      <description>XMC4500 Relax Lite Kit Board Support and Examples</description>
      <image small="Images\XMC4500-Relax_Lite_Kit.JPG"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontroller/32-bit-industrial-microcontroller-based-on-arm-registered-cortex-tm-m/32-bit-xmc4000-industrial-microcontroller-arm-registered-cortex-tm-m4/channel.html?channel=db3a30433580b3710135a03abaf9385e" title="XMC4500 Relax / Relax Lite Kit Web Page"/>
      <book category="schematic" name="Documents\PCB_Sources_Eagle_XMC4500_Relax_V1.zip" title="Schematics"/>
      <book category="manual"    name="Documents\Board_Users_Manual_XMC4500_Relax_Kit-V1_R1.2.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC4500-F100x1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC4500 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>      
        <feature type="XTAL"      n="12000000"/>
        <feature type="XTAL"      n="32768"/>
        <feature type="ROM"       n="1"              name="32 MBit Quad-SPI Flash"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="USB"       n="1"              name="USB Device (Micro-AB)"/>
        <feature type="MemCard"   n="1"              name="SD Card Holder"/>        
        <feature type="ETH"       n="1" m="10000000" name="Ethernet RJ45 Plug, Würth"/>
        <feature type="Button"    n="3"              name="BUTTON1(P1.14), BUTTON2(P1.15), RESET"/>
        <feature type="ContOther" n="1"              name="2-Pin DIP Switch (Hardware boot mode selection)"/>
        <feature type="LED"       n="2"              name="LED1(P1.1), LED2(P1.0)"/>
      <debugInterface adapter="J-Link Lite" connector="Micro-USB"/>
    </board>

    <board vendor="Infineon" name="XMC4700/XMC4800 Relax Kit Series" revision="V1" salesContact="sales@infineon.com" orderForm="http://ehitex.com/starter-kits/for-xmc4000/410/xmc4500-relax-kit">
      <description>XMC4700/XMC4800 Relax Kit Series Support and Examples</description>
      <image small="Images\Hexagon-XMC4500-small.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontroller/32-bit-industrial-microcontroller-based-on-arm-registered-cortex-tm-m/32-bit-xmc4000-industrial-microcontroller-arm-registered-cortex-tm-m4/channel.html?channel=db3a30433580b3710135a03abaf9385e" title="XMC4500 Relax / Relax Lite Kit Web Page"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC4800-F100x1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC4800 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>      
        <feature type="XTAL"      n="14400000"/>
        <feature type="XTAL"      n="32768"/>
        <feature type="ROM"       n="1"              name="32 MBit Quad-SPI Flash"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="USB"       n="1"              name="USB Device (Micro-AB)"/>
        <feature type="MemCard"   n="1"              name="SD Card Holder"/>        
        <feature type="ETH"       n="1" m="10000000" name="Ethernet RJ45 Plug, Würth"/>
        <feature type="Button"    n="3"              name="BUTTON1(P1.14), BUTTON2(P1.15), RESET"/>
        <feature type="ContOther" n="1"              name="2-Pin DIP Switch (Hardware boot mode selection)"/>
        <feature type="LED"       n="2"              name="LED1(P1.1), LED2(P1.0)"/>
      <debugInterface adapter="J-Link Lite" connector="Micro-USB"/>
    </board>
    
  </boards>
  
  
  <conditions>                                                                
  <!-- conditions are dependecy rules that can apply to a component or an individual file -->
 
    <condition id="XMC4100_F64">                                     
      <description>Infineon XMC4100 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4100-F64*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4100_Q48">                                     
      <description>Infineon XMC4100 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4100-Q48*"/>
      <require Tcompiler="ARMCC"/>
    </condition>    
    
