jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
    <condition id="XMC4104_F64">                                     
      <description>Infineon XMC4104 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-F64*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4104_Q48">                                     
      <description>Infineon XMC4104 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4104-Q48*"/>
      <require Tcompiler="ARMCC"/>
    </condition>    
 
    <condition id="XMC4108_F64">                                     
      <description>Infineon XMC4108 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4108-F64*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4108_Q48">                                     
      <description>Infineon XMC4108 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4108-Q48*"/>
      <require Tcompiler="ARMCC"/>
    </condition>     
 
    <condition id="XMC41xx">                                     
      <accept condition="XMC4100_Q48"/>
      <accept condition="XMC4100_F64"/>
      <accept condition="XMC4104_Q48"/>
      <accept condition="XMC4104_F64"/>
      <accept condition="XMC4108_Q48"/>
      <accept condition="XMC4108_F64"/>
    </condition>

    <condition id="XMC4200_F64">                                     
      <description>Infineon XMC4200 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4200-F64*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4200_Q48">                                     
      <description>Infineon XMC4200 series VQFN48</description>
      <require Dvendor="Infineon:7" Dname="XMC4200-Q48*"/>
      <require Tcompiler="ARMCC"/>
    </condition>    
    
    <condition id="XMC42xx">                                     
      <description>Infineon XMC42xx series</description>
      <accept condition="XMC4200_Q48"/>
      <accept condition="XMC4200_F64"/>
    </condition>

    <condition id="XMC4400_F100">                                     
      <description>Infineon XMC4400 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4400-F100*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4400_F64">                                     
      <description>Infineon XMC4400 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4400-F64*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4402_F100">                                     
      <description>Infineon XMC4402 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4402-F100*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4402_F64">                                     
      <description>Infineon XMC4402 series LQFP64</description>
      <require Dvendor="Infineon:7" Dname="XMC4402-F64*"/>
      <require Tcompiler="ARMCC"/>
    </condition>    
    
    <condition id="XMC44xx">                                     
    <description>Infineon XMC44xx series</description>
      <accept condition="XMC4400_F100"/>
      <accept condition="XMC4400_F64"/>
      <accept condition="XMC4402_F64"/>
      <accept condition="XMC4402_F100"/>
    </condition>
    
    <condition id="XMC4500_F144">                                     
      <description>Infineon XMC4500 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4500-?144*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4500_F100">                                     
      <description>Infineon XMC4500 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4500-F100*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4502_F100">                                     
      <description>Infineon XMC4502 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4502-F100*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4504_F144">                                     
      <description>Infineon XMC4504 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4504-F144*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4504_F100">                                     
      <description>Infineon XMC4504 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4504-F100*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC45xx">                                     
      <description>Infineon XMC45xx series</description>
      <accept condition="XMC4500_F144"/>
      <accept condition="XMC4500_F100"/>
      <accept condition="XMC4502_F100"/>
      <accept condition="XMC4504_F100"/>
      <accept condition="XMC4504_F144"/>
    </condition>

    <condition id="XMC4700_E196">                                     
      <description>Infineon XMC4700 series BGA196</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-E196*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    
    <condition id="XMC4700_F144">                                     
      <description>Infineon XMC4700 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-F144*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4700_F100">                                     
      <description>Infineon XMC4700 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4700-F100*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    
    <condition id="XMC47xx">                                     
      <description>Infineon XMC45xx series</description>
      <accept condition="XMC4700_E196"/>
      <accept condition="XMC4700_F144"/>
      <accept condition="XMC4700_F100"/>
    </condition>

    <condition id="XMC4800_E196">                                     
      <description>Infineon XMC4800 series BGA196</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-E196*"/>
      <require Tcompiler="ARMCC"/>
    </condition>    

