jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
    <condition id="XMC4800_F144">                                     
      <description>Infineon XMC4800 series LQFP144</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-F144*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="XMC4800_F100">                                     
      <description>Infineon XMC4800 series LQFP100</description>
      <require Dvendor="Infineon:7" Dname="XMC4800-F100*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    
    <condition id="XMC48xx">                                     
      <description>Infineon XMC45xx series</description>
      <accept condition="XMC4800_E196"/>
      <accept condition="XMC4800_F100"/>
      <accept condition="XMC4800_F144"/>
    </condition>
    
    <condition id="XMC4">                                     
      <description>Infineon XMC4000 family</description>
      <accept  condition="XMC41xx"/>
      <accept  condition="XMC42xx"/>      
      <accept  condition="XMC44xx"/>      
      <accept  condition="XMC45xx"/>  
      <accept  condition="XMC47xx"/>      
      <accept  condition="XMC48xx"/>
    </condition>

    <condition id="XMC4 CMSIS">
      <description>Infineon XMC4000 family and CMSIS-CORE and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>	  
    </condition>

    <condition id="XMC4 CMSIS SCU">
      <description>Infineon XMC4000 family and CMSIS-CORE and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>	  
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
    </condition>
    
    <condition id="XMC4 CMSIS RTOS">
      <description>Infineon XMC4000 family, CMSIS-CORE and CMSIS-RTOS and ARMCC compiler</description>
      <require condition="XMC4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
    </condition>

    <condition id="XMC4 CMSIS Driver Ethernet MAC">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver Ethernet MAC</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4400_F100"/>
      <accept  condition="XMC4400_F64"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver USBD">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USBD</description>
      <accept  condition="XMC48xx"/>
      <accept  condition="XMC47xx"/>
      <accept  condition="XMC4500_F144"/>
      <accept  condition="XMC4500_F100"/>
      <accept  condition="XMC4502_F100"/>
      <accept  condition="XMC44xx"/>
      <accept  condition="XMC42xx"/>
      <accept  condition="XMC4100_F64"/>
      <accept  condition="XMC4100_Q48"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>   
    </condition>    

    <condition id="XMC4 CMSIS Driver I2C">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver I2C</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="I2C"/>
    </condition>    
    
    <condition id="XMC4 CMSIS Driver SPI">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver SPI</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
    </condition>    

    <condition id="XMC4 CMSIS Driver USART">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="UART"/>
    </condition>    

    <condition id="XMC4 HAL GPIO">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>          
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />    
    </condition>

    <condition id="XMC4 HAL VADC">
      <description>Infineon XMC4000 family, XMC4 CMSIS Driver USART</description>
      <require condition="XMC4 CMSIS"/>   
      <require Cclass ="Device" Cgroup="XMClib" Csub="GPIO" />               
      <require Cclass ="Device" Cgroup="XMClib" Csub="VADC" />    
    </condition>
    
</conditions>

  <examples>
    <!-- Infineon XMC4200 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC4200 Application Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards\Infineon\XMC4200 Application Kit\Middleware\USB\Device\VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4200 CPU Board - Actuator  (CPU_42A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    
    <!-- Infineon XMC4400 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC4400 Application Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards\Infineon\XMC4400 Application Kit\Middleware\USB\Device\VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    
    <!-- Infineon XMC4500 Boot Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Application Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>  
    
    <example name="USB Human Interface Device" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Application Kit\Middleware\USB\Device\HID" version="1.0.0">
      <description> USB HID example using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC4500_App_Kit_USB_HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    
    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Application Kit\Middleware\USB\Device\MassStorage" version="1.0.0">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>      
    
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Application Kit\Middleware\USB\Device\VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  
    
    <!-- Infineon XMC4500 Relax Lite Kit -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Relax Lite Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>      
    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Relax Lite Kit\Middleware\USB\Device\MassStorage" version="1.0.0">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  
    <example name="USB Human Interface Device" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Relax Lite Kit\Middleware\USB\Device\HID" version="1.0.0">
      <description> USB HID example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Relax_USB_HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards\Infineon\XMC4500 Relax Lite Kit\Middleware\USB\Device\VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  
    
    <!-- Infineon XMC4800 Boot Kit -->  
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Infineon\XMC4800 Relax Kit\Blinky">
      <description>Blinky example</description>
      <board name="XMC4700/XMC4800 Relax Kit Series" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC4800_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards\Infineon\XMC4800 Relax Kit\Middleware\USB\Device\MassStorage" version="1.0.0">
      <description> USB MSC example using MDK-Professional Middleware</description>
      <board name="XMC4700/XMC4800 Relax Kit Series" vendor="Infineon"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>      
    
