jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="Boards\Infineon\XMC4800 Relax Kit\Middleware\USB\Device\VirtualCOM" version="1.0.0">
      <description> USB VCOM example using MDK-Professional Middleware</description>
      <board name="XMC4700/XMC4800 Relax Kit Series" vendor="Infineon"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
      </attributes>
    </example>  

    
    <!-- Infineon XMC4 Low Level Driver (LLD) Examples -->
    <!-- CAN -->    
    <example name="CAN" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\CAN\CAN_LOOPBACK">
      <description>CAN example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\can_loopback.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- CCU4 -->    
    <example name="CCU4" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\CCU4\CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="CCU4" doc="Readme.txt" folder="Device\XMClib\examples\XMC4800_series\CCU4\CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC4700/XMC4800 Relax Kit Series" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- CCU8 -->    
    <example name="CCU8" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\CCU8\CCU8_TIMER">
      <description>CCU8 example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ccu8_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- DAC -->    
    <example name="DAC" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\DAC\DAC_SINE">
      <description>DAC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\dac_sine.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   
    <example name="DAC" doc="Readme.txt" folder="Device\XMClib\examples\XMC4800_series\DAC\DAC_SINE">
      <description>DAC example</description>
      <board name="XMC4700/XMC4800 Relax Kit Series" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\dac_sine.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DAC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- DMA -->    
    <example name="DMA" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\DMA\DMA_M2M">
      <description>DMA example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\dma_m2m.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="DMA"/>       
        <category>LLD Examples</category>
      </attributes>
    </example> 
     <!-- EBU -->    
    <example name="EBU" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\EBU\EBU_SDRAM"> 
      <description>XMC Lib External Bus Interface (EBU) example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ebu_sdram.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="EBU"/>  
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>               
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- ERU -->    
    <example name="ERU" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\ERU\ERU_EXTINT"> 
      <description>XMC Lib ERU external interrupt example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\eru_extint.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>  
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>               
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- FCE -->    
    <example name="FCE" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\FCE\FCE_CRC">
      <description>FCE example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\fce_crc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FCE"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- FLASH -->    
    <example name="FLASH" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\FLASH\FLASH_PROGRAM"> 
      <description>FLASH example</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\flash_program.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>
        <category>LLD Examples</category>
      </attributes>
    </example>
    <!-- GPIO -->    
    <example name="GPIO" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\GPIO\GPIO_TOGGLE"> 
      <description>XMC Lib GPIO toggle example flashes the leds of the board with a periodic rate</description>
      <board name="XMC4500 Relax Lite Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\gpio_toggle.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>                    

    <!-- HRPWM_CSG -->    
    <example name="HRPWM_CSG" doc="Readme.txt" folder="Device\XMClib\examples\XMC4400_series\HRPWM\HRPWM_CSG"> 
      <description>XMC Lib High Resolution PWM (HAPWM) driver example - CSG </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\hrpwm_csg.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 

