jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
    <!-- HRPWM_HRC -->    
    <example name="HRPWM_HRC" doc="Readme.txt" folder="Device\XMClib\examples\XMC4400_series\HRPWM\HRPWM_HRC"> 
      <description>XMC Lib High Resolution PWM (HAPWM) driver example - HRC </description>
      <board name="XMC4400 CPU Board - General Purpose  (CPU_44A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\hrpwm_hrc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>      
        <component Cclass="Device" Cgroup="XMClib" Csub="HRPWM"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
        
    <!-- I2C -->    
    <example name="I2C" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\I2C\I2C_TRANSFER">
      <description>I2C example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\i2c_transfer.uvprojx"/>     
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="I2C"/>   
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>              
        <category>LLD Examples</category>
      </attributes>
    </example> 
    <!-- LEDTS -->    
    <example name="LEDTS" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\LEDTS\LEDTS_TOUCH">
      <description>LEDTS example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ledts_touch.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>         
        <category>LLD Examples</category>
      </attributes>
    </example>    
    <!-- RTC -->    
    <example name="RTC" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\RTC\RTC_ALARM">
      <description>RTC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\rtc_alarm.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>            
    <!-- SPI -->    
    <example name="SPI" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\SPI\SPI_TRANSMIT">
      <description>SPI example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\spi_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>          
        <category>LLD Examples</category>
      </attributes>
    </example> 
    <!-- UART -->    
    <example name="UART" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\UART\UART_TRANSMIT">
      <description>UART example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\uart_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- VADC -->    
    <example name="VADC" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\VADC\VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>
    <example name="VADC" doc="Readme.txt" folder="Device\XMClib\examples\XMC4800_series\VADC\VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC4700/XMC4800 Relax Kit Series" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>
        <category>LLD Examples</category>
      </attributes>
    </example>  
    
    <!-- WDT -->    
    <example name="WDT" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\WDT\WDT_FEED">
      <description>WDT example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45A)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example>                               
    <!-- EBU -->    
    <example name="EBU" doc="Readme.txt" folder="Device\XMClib\examples\XMC4500_series\EBU\EBU_SDRAM">
      <description>EBU example</description>
      <board name="XMC4500 CPU Board - General Purpose (CPU_45B)" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM\ebu_sdram.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="EBU"/>
        <category>LLD Examples</category>
      </attributes>
    </example>                               
               
