jack77er/openUTRUSTA/Packages/.cache/Infineon.XMC4000_DFP.2.4.0.pdsc
     <component Cclass="Device" Cgroup="XMClib" Csub="SDMMC" Cversion="2.1.2" condition="XMC4 CMSIS SCU">
      <description>Secure Digital/Multi Media Card (Interface) (SDMMC) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_SDMMC
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___s_d_m_m_c.html"/>
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source" name="Device\XMClib\src\xmc_common.c"/>
        <file category="source" name="Device\XMClib\src\xmc_sdmmc.c"/>
      </files>
    </component>
    
     <component Cclass="Device" Cgroup="XMClib" Csub="SPI" Cversion="2.1.2" condition="XMC4 CMSIS SCU">
      <description>Serial Peripheral Interface (SPI) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_SPI
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___s_p_i.html"/>
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source" name="Device\XMClib\src\xmc_common.c"/>
        <file category="source" name="Device\XMClib\src\xmc_usic.c"/>
        <file category="source" name="Device\XMClib\src\xmc_spi.c"/>
      </files>
    </component>

     <component Cclass="Device" Cgroup="XMClib" Csub="UART" Cversion="2.1.2" condition="XMC4 CMSIS SCU">
      <description>Universal Asynchronous Receiver Transmitter (UART) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_UART
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___u_a_r_t.html"/>
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source" name="Device\XMClib\src\xmc_common.c"/>
        <file category="source" name="Device\XMClib\src\xmc_usic.c"/>
        <file category="source" name="Device\XMClib\src\xmc_uart.c"/>
      </files>
    </component>

     <component Cclass="Device" Cgroup="XMClib" Csub="USB" Cversion="2.1.2" condition="XMC4 CMSIS SCU">
      <description>Universal Serial Bus (USB) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_USB
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___u_s_b_d.html"/>
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source" name="Device\XMClib\src\xmc_common.c"/>
        <file category="source" name="Device\XMClib\src\xmc_usbd.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="XMClib" Csub="WDT" Cversion="2.1.2" condition="XMC4 CMSIS SCU">
      <description> Watchdog Timer (WDT) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_WDT
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___w_d_t.html"/>
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source" name="Device\XMClib\src\xmc_common.c"/>
        <file category="source" name="Device\XMClib\src\xmc_wdt.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="FCE" Cversion="2.1.2" condition="XMC4 CMSIS SCU">
      <description> Flexible CRC Engine (FCE) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_FCE
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___f_c_e.html"/>
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source" name="Device\XMClib\src\xmc_common.c"/>
        <file category="source" name="Device\XMClib\src\xmc_fce.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="FLASH" Cversion="2.1.2" condition="XMC4 CMSIS SCU">
      <description> Flash Driver (FLASH) driver for XMC4000</description>
      <RTE_Components_h>
        #define RTE_DEVICE_XMCLIB_FLASH
      </RTE_Components_h>  
      <files>
        <file category="doc"    name="Device\XMClib\doc\html\group___f_l_a_s_h.html"/>
        <file category="include" name="Device\XMClib\inc\"/>
        <file category="source" name="Device\XMClib\src\xmc_common.c"/>
        <file category="source" name="Device\XMClib\src\xmc4_flash.c"/>
      </files>
    </component>                              
    
    <!-- END: Infineon Standard Peripherals Low Level Drivers -->

    <!-- START: CMSIS Peripherals Drivers -->
        
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.01" Cversion="2.04" condition="XMC4 CMSIS Driver Ethernet MAC">
      <description>Ethernet MAC Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_ETH_MAC
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\ETH_MAC.c"/>        
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Csub="KSZ8031" Capiversion="2.00" Cversion="1.00" condition="XMC4 CMSIS">
      <!-- short component description -->
      <description>Ethernet PHY KSZ8031 Driver</description>
      <RTE_Components_h>
        #define RTE_Drivers_PHY_KSZ8031        /* Driver PHY KSZ8031 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\ETH_PHY_KSZ8031.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet PHY" Csub="KSZ8081" Capiversion="2.00" Cversion="1.00" condition="XMC4 CMSIS">
      <!-- short component description -->
      <description>Ethernet PHY KSZ8081 Driver</description>
      <RTE_Components_h>
        #define RTE_Drivers_PHY_KSZ8081        /* Driver PHY KSZ8081 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\ETH_PHY_KSZ8081.c"/>
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB" Capiversion="2.01" Cversion="2.04" condition="XMC4 CMSIS Driver USBD">
      <description>USB Device Driver for the XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\USBD.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02" Cversion="2.03" condition="XMC4 CMSIS Driver I2C">
      <description>I2C Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C                
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\I2C.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.01" Cversion="2.05" condition="XMC4 CMSIS Driver SPI">
      <description>SPI Driver for XMC4000 Family</description>
      <RTE_Components_h>
        #define RTE_Drivers_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\SPI.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.01" Cversion="2.05" condition="XMC4 CMSIS Driver USART">
      <description>USART Driver for XMC4000 Family</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART              
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART.c"/>
      </files>
    </component>
    
    <!-- END: CMSIS Peripherals Drivers -->


    <!-- Board Support Pack (BSP) for XMC4500 Relax Kit -->   

    <bundle Cbundle="XMC4500 Relax Lite Kit" Cclass="Board Support" Cversion="1.0.0">
      <description>XMC4500 Relax Lite Kit Board Support</description>    
      <doc>Documents\Board_Users_Manual_XMC4500_Relax_Kit-V1_R1.2.pdf</doc>    
      <component Cgroup="A/D Converter" condition="XMC4 HAL VADC">
        <description>A/D Converter interface for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards\Infineon\XMC4500 Relax Lite Kit\Common\ADC_XMC4500.c"/>
        </files>
      </component>       
      <component Cgroup="LED" condition="XMC4 HAL GPIO">
        <description>LED driver for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards\Infineon\XMC4500 Relax Lite Kit\Common\LED_XMC4500.c"/>
        </files>
      </component>                        
      <component Cgroup="Buttons" condition="XMC4 HAL GPIO">
        <description>Button driver for XMC4500 Relax Lite Kit</description>
        <files>
          <file category="source" name="Boards\Infineon\XMC4500 Relax Lite Kit\Common\Buttons_XMC4500.c"/>
        </files>
      </component>     
    </bundle>
    

    
  </components>
</package>
